Tekla Open API Reference for Tekla Structures 2025
WeldGeometry.Polygons Property
 Gets the weld seam specific ArrayList of Polygon objects.
 Namespace: Tekla.Structures.Model.Welding
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Polygons { get; }
Public ReadOnly Property Polygons As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
WeldGeometry Class
Tekla.Structures.Model.Welding Namespace